Repository: magi1125/inclusive-design-pattern
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: (Note: To ensure the media query triggers at the correct point relative to user-defined font size, we are using the em unit there, too.
ja: (注：ユーザーが指定したフォントサイズに対して相対的に正しい位置で確実にメディアクエリが実行されるようにするために、単位にemを使っています。

source: (See what I did there?)
ja: （悪い例を実演してみました）。

source: 10th to 12th grade
ja: 10～12年生

source: 5th grade
ja: 5年生

source: 6th grade
ja: 6年生

source: 7th grade
ja: 7年生

source: 8th & 9th grade
ja: 8、9年生

source: <div class="meta">Published on <time datetime="2017-12-12">12/12/2017</time></div>
ja: <div class="meta">公開日 <time datetime="2017-12-12">12/12/2017</time></div>

source: right: 100%; /* moves off screen */ } [href="#main"]:focus {
ja: right: 100%; /* 画面外に移動 */ } [href="#main"]:focus {

source: <h1>How To Mark Up Inclusive Blog Articles</h1>
ja: <h1>インクルーシブなブログ記事のマークアップ方</h1>

source: <!-- second article’s content here --> </article> <article>
ja: <!-- ここに2番目の記事のコンテンツ --> </article> <article>

source: <h2>In Seven Simple Steps</h2> </hgroup>
ja: <h2>～シンプルな7つのステップで～</h2> </hgroup>

source: <h2>In Seven Simple Steps</h2> <!-- this should not be a heading -->
ja: <h2> ～シンプルな7つのステップで～</h2> <!-- これは見出しにすべきではありません -->

source: /* (life is too short) p {
ja: /* (人生はとても短い) p {

source: <!-- do not use --> <hgroup>
ja: <!-- これは使わないでください --> <hgroup>

source: <!-- don’t use this --> <main id="main">
ja: <!-- これは使わないでください --> <main id="main">

source: <!-- don’t use this --> <meta name="viewport" content="width=device-width, initial-scale=1.0, minimum-scale=1.0, maximum-scale=1.0, user-scalable=no"> <!-- use this --> <meta name="viewport" content="width=device-width, initial-scale=1.0">
ja: <!-- これは使わないでください --> <meta name="viewport" content="width=device-width, initial-scale=1.0, minimum-scale=1.0, maximum-scale=1.0, user-scalable=no"> <!-- これを使ってください --> <meta name="viewport" content="width=device-width, initial-scale=1.0">

source: <h1>How To Mark Up Blog Articles</h1> <!-- introductory content --> <h3>A quick note on the word ‘semantic’</h3> <!-- wait!
ja: <h1>ブログ記事のマークアップ方法</h1> <!-- 序文コンテンツ--> <h3>「セマンティック」という単語について</h3> <!-- 待って！

source: <h1>How To Mark Up Blog Articles</h1> <p><span class="visually-hidden">Subtitle:</span> In Seven Easy Steps</p>
ja: <h1>ブログ記事のマークアップ方法</h1> <p><span class="visually-hidden">サブタイトル:</span> ～シンプルな7つのステップで～</p>

source: <h2 class="h3">What am I?</h2>
ja: <h2 class="h3">私は何でしょう？</h2>

source: <h2>Free flapjacks, you say?
ja: フラップジャックが無料ですって？

source: <h2>Free, you say?
ja: <h2>無料ですって？

source: <html lang="en" <!-- language set to English -->
ja: <html lang="en" <!-- 言語を英語に設定 -->

source: <script>// TODO: enhancement </script> </body>
ja: <script>// TODO：エンハンスメント</script> </body>

source: The British Dyslexia Association notes some specific characteristics3 that can aid legibility.
ja: 英国ディスレクシア協会（British Dyslexia Association）は、読みやすさを向上できるいくつかの特徴に言及しています。（脚注18）

source: To my wife, Fan, who has the power to make me smile, in spite of the world.
ja: こんな世界でも私を笑顔にしてくれる、我が妻ファン（Fan）に捧ぐ。

source: What’s free?
ja: 何が無料なのでしょう？

source: •1 point: it benefits me
ja: •1 点: 自分が恩恵を受ける

source: •10 points: it benefits a user/reader like me and with my setup
ja: •10 点: 自分と似た、同じ設定をしているユーザーや読者が恩恵を受ける

source: •100 points: it benefits me, people like me, and users/readers unlike me, with differing setups
ja: •100 点: 自分、自分と似たユーザー、および自分とは似つかない、異なる設定のユーザーや読者が恩恵を受ける

source: •A list of the longer sentences (more than 35 words).
ja: • 長い文章の一覧（36単語以上）

source: •A list of the longer words (more than four syllables).
ja: • 長い単語の一覧（5音節以上）

source: •A measure that’s too long or too short.
ja: •長すぎる、または短すぎるカラム幅

source: •Are individual letterforms distinct in shape or can they be confused with others?
ja: • 個々の文字の形がはっきり区別でき、他の文字と紛らわしくないか？

source: •Are the metrics (such as x-height2) consistent between letterforms?
ja: • 各種の文字のメトリクス（x-height（脚注17）など）に一貫性があるか？

source: •Be wary of passive sentences21.
ja: •受動態の文（脚注35）に気をつける。

source: •Does it have any ornamentation that gets in the way of comprehension?
ja: • 理解の邪魔になる装飾がないか？

source: •Does the typeface support all of the characters and font styles that are needed?
ja: • その書体は、必要とされるすべての文字とフォントスタイルをサポートしているか？

source: •Eliminate redundancy.
ja: • 重複は避ける。

source: •Eliminating focus styles with outline: none;.
ja: •outline:none;を使用してフォーカススタイルを削除

source: •Flesch reading ease score (out of 100; higher means more readable).
ja: • Flesch Reading Easeの得点（100点満点、高いほど読みやすい）

source: •Headings
ja: •見出し

source: •How To Mark Up Blog Articles
ja: •ブログ記事のマークアップ方法

source: •How To Mark Up Blog Articles In Seven Simple Steps
ja: •ブログ記事のマークアップ方法 ～シンプルな7つのステップで～

source: •In Seven Simple Steps
ja: •～シンプルな7つのステップで～

source: •It can be confounding for users when a pinch/spread gesture is interpreted as something else.
ja: •ピンチイン・ピンチアウトの動作が拡大縮小以外の意味に解釈されるとユーザーが混乱する。

source: •It does not complicate the editorial process.
ja: • 編集プロセスを複雑にしない。

source: •It provides accessible information to users.
ja: •アクセシブルな情報をユーザーに提供する。

source: •Link text
ja: •リンクテキスト

source: •Make sure the element is focusable.
ja: • 要素をフォーカス可能にする。

source: •Make sure the focus state of the element is visible.
ja: • 要素のフォーカス状態を見えるようにする。

source: •Make sure the focusable element is visible.
ja: •フォーカス可能な要素を見えるようにする。

source: •Notes about the score.
ja: • 得点に関する補足

source: •Reasonably high contrast, without defaulting to stark black on white.
ja: •デフォルトの白地に黒ではない、十分に高いコントラスト

source: •Selecting words to copy/paste may be easier for users when the text is larger.
ja: • テキストを大きくすると、コピー&ペーストしたい単語を選択しやすくなる。

source: •Subsections
ja: •サブセクション

source: •The developer did a poor job of responsive design, and the user needs to zoom just to use the page (this happens!).
ja: • 開発者のレスポンシブデザインの作りかたがまずいと、ページを利用するために拡大縮小が必要になる（これがよくあるのです!）。

source: •The text may be too small for the user to read.
ja: •テキストが小さすぎて読めない恐れがある。

source: •The user may want to see more detail in an image.
ja: • 画像の細部を見たいユーザーがいるかもしれない。

source: •The user wants to crop animated elements out of the view to reduce distraction.
ja: • 気が散らないように、動く要素を視界の外に追い出したいユーザーがいる。

source: •There is a browser bug or quirk (still a bug) that causes the default zoom level to be odd.
ja: • ブラウザのバグや奇妙なふるまい（これも要するにバグ）のせいで、デフォルトの表示倍率では正しく表示されないことがある。

source: •Vary the length of sentences and paragraphs.
ja: •文章やパラグラフの長さに変化をつける。

source: •Wording and typefaces designed to impress rather than communicate.
ja: •• 伝達することではなく、印象づけることを目的にデザインした言葉遣いや書体

source: •Write short paragraphs, sentences and words.
ja: •パラグラフ、文章、単語は短くする。

source: <!-- third article’s content here --> </article>
ja: <!-- ここに3番目の記事のコンテンツ --> </article>

source: /* alternative text rules */
ja: /* 代替テキスト */

source: content: '(external link)';
ja: content: '(外部リンク)';

source: <!-- blog article here -->
ja: <!-- ここにブログ記事 -->

source: text-indent: 1em; /* the width of the icon */ }
ja: text-indent: 1em; /* アイコンの幅 */ }

source: <!-- article content here --> </main> <!-- use this --> <main id="main">
ja: <!-- ここに記事のコンテンツ --> </main> <!-- これを使ってください --> <main id="main">

source: <!-- article content here -->
ja: <!-- ここに記事のコンテンツ -->

source: <!-- article content here --> </main>
ja: <!-- ここに記事のコンテンツ --> </main>

source: /* do not do this */
ja: /* この指定は使わないでください */

source: Extensions are available11 to apply your own CSS on a per-domain basis.
ja: 拡張機能（脚注14）を使えばオリジナルのCSSをドメインベースで適用できます。

source: font-family: French Font, fallback, sans-serif; }
ja: font-family: フランス語フォント, フォールバック用フォント, sans-serif; }

source: font-family: SubsettedWebFont, ExtensiveSystemFont, sans-serif; }
ja: font-family: サブセット化したWebフォント, システムフォント, sans-serif; }

source: <!-- first article’s content here --> </article> <article>
ja: <!-- ここに最初の記事のコンテンツ --> </article> <article>

source: <h1>How To Mark Up Blog Articles</h1>
ja: <h1>ブログ記事のマークアップ方法</h1>

source: <!-- blog article here --> </main>
ja: <!-- ここにブログ記事 --> </main>

source: <!-- this page’s unique content --> </main>
ja: <!-- このページ独自のコンテンツ --> </main>

source: <h1>How To Mark Up Inclusive Blog Articles</h1> </main>
ja: <h1>インクルーシブなブログ記事のマークアップ方法</h1> </main>

source: A background color creates a filled box which is easier to identify as focus moves between elements than the dotted outline some browsers provide by default.
ja: 要素のうしろが背景色で塗りつぶされます。一部のブラウザがデフォルトで提供する点線のアウトラインよりも、要素間でのフォーカスの移動がわかりやすくなります。

source: Although sans serif fonts are generally thought to be more readable, their simplicity makes them more vulnerable to having similar letterforms.
ja: サンセリフフォントは一般に読みやすいと考えられていますが、簡素であるため、似た字形になりやすいという特徴があります。

source: Another advantage of being able to eliminate subsidiary content is the ability to improve the on-screen reading experience.
ja: 補助的なコンテンツを省けるようにするもう一つのメリットは、画面で読むユーザーの体験が向上するということです。

source: Enhancement is a great thing, but only where it’s really needed.
ja: エンハンスメントはすばらしいですが、本当に必要な箇所だけで使いましょう。

source: Justified text produces the worst results when using a narrow measure, such as in the column-based layout illustrated.
ja: 均等割り付けされたテキストは、図のようなカラムベースのレイアウトを行う場合など、カラム幅が狭いときに最悪の結果をもたらします。

source: Missing layers in document structure can be disorienting to users trying to build a mental map of the document.
ja: ドキュメント構造内で階層が欠けていると、ドキュメントの階層を思い描こうとしているユーザーは混乱します。

source: The danger of a line height that is not relative to the font size.
ja: フォントサイズに比例しない行の高さは危険です。

source: When using custom, gradient-based underlines you have the luxury of being able to control their color independently of the font color.
ja: カスタムのグラデーションベースのアンダーラインを使用すると、フォントの色とは独立してアンダーラインの色だけを変えることもできます。

source: Your interface is not the only interface users are interacting with when their browsers are open.
ja: ユーザーがブラウザを開いたときに使用するインターフェイスは、あなたがデザインするインターフェイスだけではありません。

source: Your responsive design should cover every width.
ja: レスポンシブデザインはあらゆる幅に対応しているべきです。

source: A solution partly developed at Medium15 does just this, using a CSS background gradient and text shadow.
ja: Mediumが一部を開発した解決策（脚注29）は、CSSの背景グラデーションとテキストシャドウを使用して、まさにそれを実現しています。

source: A d and b which were not an exact mirror image of one another also helped, as well as a clear distinction between an uppercase I, lowercase l and 1.
ja: また、dとbが完璧な鏡文字ではないこと、大文字のIと小文字のlと数字の1がはっきりと区別されていることも読みやすさにつながります。

source: A Blog Post
ja: ブログ記事

source: A Note On Frameworks, Preprocessors And Task Runners
ja: フレームワーク、プリプロセッサ、タスクランナーについての注意

source: A Note on Single-Page Applications
ja: シングルページアプリケーションに関する注意

source: A Paragraph
ja: パラグラフ

source: A font that supports a large, international character set is an inclusive font.
ja: 広範な国際文字セットをサポートしているフォントはインクルーシブなフォントと言えます。

source: A good module has an independent purpose that can be lent seamlessly to a number of different contexts.
ja: 適切なモジュールには、多様なコンテキストでシームレスに役立つ、独立した目的があります。

source: A good way to test that your content has a sound structure is to turn CSS off and see if the page is still readable.
ja: コンテンツに音としての構造があることをテストする良い方法は、CSSをオフにしてもページが読めるかどうかを確認することです。

source: A lot of web design articles and books are about improving your workflow and making your life easier as a developer.
ja: Webデザイン関連の記事や本には、ワークフローの改善や、開発者側が楽をするための方法が書かれたものがたくさんあります。

source: A more comprehensive way of overcoming FOIT is offered by Bram Stein7 and requires a small JavaScript dependency.
ja: JavaScriptに少し依存することになりますが、より包括的なFOIT対策をブラム・スタイン（Bram Stein）が提供しています（脚注10）。

source: A mouse is an HID.
ja: マウスもそのひとつです。

source: A number of survey respondents also professed to navigate documents from element to element, reading from the start to the end using their screen reader’s down arrow key (or equivalent).
ja: また、回答者の何人かは、スクリーンリーダーの下矢印キー（またはそれに相当するキー）を使用して、ドキュメントを先頭から末尾に向かって、要素から要素へと移動していると答えています。

source: A paragraph’s measure is the length, in characters, of one line.
ja: パラグラフのカラム幅とは、1行の長さ、文字数のことです。

source: A products page would describe the products within <main>.
ja: 製品のページの場合は、<main>の中で製品説明を行います。

source: A skip link appears above all other content on the page and points to the main content area.
ja: スキップリンクはページの一番上に表示され、そこからメインコンテンツ領域にジャンプすることができます。

source: A small, black box represents the smallest conceivable viewport and a larger gray box grows from it to represent infinite larger viewports.
ja: 図：小さい実線のボックスは想定される最小のビューポートを表し、そこから横に伸びる大きい点線のボックスは無限に引き伸ばしたビューポートを表している。

source: A syndicated version of your content, subject to a different style sheet, would diverge in visual structure too.
ja: RSSリーダーなどを通じて表示される際には、異なるスタイルシートが適用されるため、視覚的な構造が異なるものになることもあります。

source: Accordingly, serif typefaces are generally regarded as overcomplex, but a purposeful use of serifs to differentiate characters is actually beneficial.
ja: 複雑すぎるとみなされているセリフ書体も、文字を区別するために意図的に使えば、実際に読みやすくなることがあります。

source: Accordingly, the following heading content would be of greater utility (at least if this section of the blog article is indeed about flapjacks, otherwise it would be rather misleading!).
ja: したがって、以下の見出しコンテンツの方がずっと便利でしょう。（少なくともブログ記事のこのセクションが本当にフラップジャックに関するものであれば。そうでなければ誤解を招きます！）

source: Acknowledging the importance of good copy design will form a part of many patterns in this book.
ja: 本書で述べる多くのパターンに、優れたコピーデザインの重要性を理解することが含まれています。

source: Adrian Roselli provides a comprehensive list of reasons why disabling this feature undermines inclusion4:
ja: エイドリアン・ロセッリ（Adrian Roselli）がリストアップした、 拡大縮小を無効にするとインクルージョンが損なわれる理由（脚注7）は以下のとおりです。

source: All the better.
ja: さらに良くなりますね。

source: Allow Pinch-to-Zoom
ja: ピンチによる拡大縮小を可能にする

source: Alternative Text
ja: 代替テキスト

source: Altogether, deploying <article> doesn’t look very appealing, but there is a small advantage in certain contexts.
ja: 結局のところ、<article>の配置にはあまり魅力がなさそうですが、ある特定のコンテキストではちょっとした利点があります。

source: Amid a maintenance-centric quality assurance culture largely designed by developers for developers, this is most welcome.
ja: 開発者が開発者のために作ってきた、コードのメンテナンス性を中心とした品質保証という文化がある中で、これは非常に歓迎すべきことです。

source: An given font-size: 2rem; is two times larger than the size set at the root.
ja: たとえば にfont-size:2remが指定されていると、ルートで設定されているサイズの2倍の大きさになります。

source: An inclusive editorial system should be streamlined so that it doesn’t force editors to think about and deal in code or formatting.
ja: インクルーシブな編集システムを整備して、編集者がフォーマットを考えたり、コードを書いたりしないで済むようにする必要があります。

source: And utility depends on cognition, which depends on convention.
ja: そして実用性は認知に依存しており、認知は慣習に依存します。

source: Any link href which begins with http (i.e. is not a relative link) and does not link to the current domain passes muster.
ja: hrefの値がhttpで始まり（つまり相対リンクではない）、かつ、現在のドメインにリンクしていないすべてのリンクが対象になります。

source: Any opinionated frameworks not easily configurable for inclusive design techniques should be avoided.
ja: インクルーシブデザインの手法に合うように調整することが容易でないような、柔軟性のないフレームワークは避けるべきです。

source: Are the order and hierarchy apparent?
ja: 順序や階層が明確にわかりますか？

source: Arguably, this is useful information where there are several <article>s on the same page and the user is reading from top to bottom, element by element.
ja: 確かに、同じページに複数の<article>があり、ユーザーが上から下に向かって要素をひとつずつ読んでいる場合には、これは有益な情報です。

source: As I’ll restate throughout the book, there’s rarely an inclusive design provision that benefits only one kind of user or reader.
ja: これから本書の中で繰り返し述べますが、一種類のユーザーだけにメリットがあるインクルーシブデザインというものはまずありません。

source: As a result, they alienated the majority of dyslexic readers as well as creating a “clunky and difficult to read” font for everyone.
ja: この結果、彼らはディスレクシアの読者の大部分を疎外しただけではなく、誰にとっても「不格好で読みにくい」フォントを作ってしまったのです。

source: As a rule of thumb, avoid using positioned elements, especially with position: fixed.
ja: 大雑把に言ってしまえば、固定配置の要素、特にposition:fixedで固定したものは使わないでください。

source: As a rule of thumb, you should never set a fixed width or height on any element: the intrinsic flexibility of boxes means they can tolerate the same content in different spaces.
ja: 大ざっぱに言ってしまえば、どんな要素も幅や高さを固定すべきではありません。ボックスに柔軟性があれば、同じコンテンツでさまざまなスペースに対応できます。

source: As discussed, an inclusive editorial experience is one where the editor is not asked to think and work in an unfamiliar way.
ja: 先ほど述べたように、インクルーシブな編集体験とは、編集者がよくわからないことを考えたり作業したりすることを求められないということです。

source: As stated in the principles outlined in the introduction, all other design activities should be treated as merely supportive of the content and its formation.
ja: 「はじめに」で概説した原則で述べたように、他のすべてのデザイン活動は、コンテンツやその構成を単に支えるものとして行うべきです。

source: As stated, our blog article should begin with an .
ja: 前述のように、ブログ記事はで開始すべきです。

source: As such, any time spent on tools will only be in cases where they can have a direct impact on the quality of the user experience.
ja: そのため、ユーザー体験をダイレクトに向上させることができるツールにのみ紙面を割いていきます。

source: As the excellent article “Designing for the extremes5” points out, designing first for users in extreme situations helps us better serve everyone.
ja: 「Designing for the extremes（脚注19）」というすばらしい記事で指摘されているように、極端な状況に置かれたユーザーを優先してデザインすることで、すべての人により良いサービスを提供できます。

source: As this MDN article on <hgroup>4 attests, however, <hgroup> has been removed from the HTML5 specification.
ja: しかし、<hgroup>についてのMDN（Mozilla Developer Network）の記事（脚注39）に示されているように、<hgroup>はHTML5仕様から削除されています。

source: As with all things, successful comprehension is a question of offering enough but not too much information.
ja: これらを考慮すると、理解できるようにするためは、十分かつ過剰ではない情報を提供することが重要です。

source: Aside from providing interactive behaviors, this is one of the simple benefits of using semantic elements where they are specified and supported.
ja: セマンティックな要素が定義され、それを使うことができるようになれば、インタラクティブな動作を提供してくれるだけでなく、このようなメリットも生まれるのです。

source: At a blog permalink, the salient content is the blog article itself, so it should be placed inside <main>.
ja: ブログのパーマリンクでは、主要なコンテンツがブログ記事そのものであるため、これを<main>の中に置く必要があります。

source: At our permalink, it should be the title of the blog article itself.
ja: ここでのパーマリンクでは、ブログ記事のタイトルそのものにします。

source: At this juncture I’d like to thank you in advance for dampening contrast in this way.
ja: 皆さんにはこの機会に、「コントラストを弱めてくれてありがとう」と前もって言っておきますね。

source: Automated Icons
ja: 自動化されたアイコン

source: Avoid repetition.
ja: 繰り返しはやめましょう

source: Bad dog!
ja: 悪いやつですね！

source: Be wary, though, of older browsers that do not support gradient backgrounds.
ja: ただし、グラデーション背景をサポートしていない古いブラウザには注意してください。

source: Bearing this in mind, no container of text in your layout should exceed your stated measure.
ja: これを念頭に置いて、想定したカラム幅を超えないようにテキストコンテナのレイアウトを調整しましょう。

source: Because not all screen reader users are alike.
ja: これは、スクリーンリーダーユーザーが皆同じではないからです。

source: Best understood by university graduates.
ja: 最も理解できるのは大学卒業者。

source: Blog articles in which the author has not been able to say everything they want in a title alone sometimes employ subtitles or straplines.
ja: ブログ記事を書く人が1つのタイトルで書きたいことすべてを書けなかった場合、サブタイトルや小見出しを使用することがあります。

source: Both NVDA and JAWS users can press the 1 key and their screen readers will transport them directly to the , where “How To Mark Up Inclusive Blog Articles, heading level one” will be announced.
ja: NVDAやJAWSでは、1キーを押すと直接に移動でき、「インクルーシブなブログ記事のマークアップ方法、見出しレベル1」と読み上げられます。

source: Box labeled ‘The important stuff’ surrounded by grayed out subsidiary boxes
ja: 「重要な部分」というラベルの付いたボックスが、グレーアウトされた補助的なボックスに囲まれている。

source: Browsers implement their own focus styles ranging from dotted outlines to fuzzy blue halos.
ja: ブラウザには、点線のアウトラインやぼんやりとした青い光の輪など、それぞれ独自のフォーカススタイルがあります。

source: But it’s possible to improve on text-decoration: underline.
ja: しかし、text-decoration: underlineをさらに改良することもできます。

source: But not everyone is like me, and making sure printed pages do not contain page elements which are only relevant when browsing on-screen is an act of considerate, inclusive design.
ja: しかし皆がそうとは限りません。したがって印刷用のページには、画面でブラウズしているときにしか意味のない要素は含めない方が、親切かつインクルーシブなデザインと言えます。

source: But there’s no use trying to be exacting.
ja: しかし、厳密にやろうとするのは無駄なことです。

source: But this isn’t much help in a table of contents, listing headings outside of body text.
ja: しかし、目次ではそういうわけにはいきません。本文から外れたところで見出しだけを一覧にしているからです。

source: But who’s it for?
ja: しかし、これはいったい誰のためのものでしょう？

source: But, since the outline algorithm is not actually implemented in any user agents7, this has no effect on assistive technology users.
ja: しかし、実際にはいずれのユーザーエージェントにもアウトラインアルゴリズムが実装されていない（脚注42）ため、支援技術ユーザーにとってこれは何の効果も、

source: By choosing a typeface that we feel the average user could read, we’d be consciously alienating a section of our users.
ja: 平均的なユーザーなら読めそうな書体を選ぶということは、ユーザーの一部を意識的に疎外するということです。

source: By creating reusable modules (or components), you can develop more rapidly, with tried-and-tested code, and eliminate redundancy.
ja: 再利用可能なモジュール（コンポーネント）を作っておけば、より迅速に開発でき、十分にテストされたコードを利用でき、冗長性も排除できます。

source: By designing documents that can respond and adapt to their environment, they become compatible with the ever proliferating choice of devices on the market.
ja: レスポンシブして環境に適応できるようにドキュメントをデザインすれば、市場に次から次へと登場するさまざまなデバイスに対応できます。

source: By differentiating inline links by color alone, some readers will not be able to pick them out from the surrounding text, so there should be another means.
ja: 色だけでインラインリンクを区別したのでは、一部の読者は周囲のテキストからリンクを見分けることができないので、別の手段が必要になるのです。

source: By dividing our blog article into subsections, we can describe which parts of it belong to which other parts, building a thematic map or outline.
ja: ブログ記事をサブセクションに分割することで、どの箇所にどの部分が属しているかを概要やアウトラインとして表現できるようになります。

source: By employing a modicum of fairly advanced CSS, it’s possible to provide iconography within paragraph text which is inclusive on two counts:
ja: 高度なCSSを少し取り入れると、次の2点においてインクルーシブな形で、パラグラフテキスト内にアイコンを入れることが可能になります。

source: By employing content breakpoints, you can ensure successful layouts for a range of devices far greater than you would ever be able to manually test with.
ja: コンテンツブレイクポイントを採用すれば、手作業でテストできないものも含んだ非常に幅広いデバイスで、レイアウトをより確実に成立させることができます。

source: By looking at typefaces, leading, measure, justification, contrast, focus indication and more, we’ve set ourselves on the right path to formulate paragraphs suited for a hugely diverse audience.
ja: 書体、行送り、カラム幅、行端揃え、コントラスト、フォーカス状態の表示などを学ぶことで、非常に多様なユーザーに合ったパラグラフを作るための、正しい第一歩を踏み出しました。

source: By managing content visually one way and non-visually another way, you begin to segregate seeing and non-seeing users.
ja: コンテンツを視覚的に扱う一方で、非視覚的には別の方法でコンテンツを処理するということは、見えているユーザーと見えていないユーザーを分離し始めているということです。

source: By providing the prefix “Subtitle:” we clarify the role of the <p> element non-visually, in much the same way as the implicit role of a <button> element makes screen readers announce “Button.”
ja: ここでは、「サブタイトル：」という接頭辞をつけることで、非視覚的に<p>要素の役割を明確化しています。これは、<button>要素の暗黙的なロールによって、スクリーンリーダーが「ボタン」と読み上げるのと同じようなやり方です。

source: By tackling specific issues we know would affect folks with limited vision, dyslexia, Irlen syndrome, low literacy and limited technical knowledge, a comfortable reading and interaction experience has been ensured for most everyone else.
ja: 視力制限、ディスレクシア、アーレン症候群であったり、識字能力に問題があったり、リテラシーが低い人々に影響すると分かっている特定の問題に対処することで、快適に読んだり、操作したりできる体験をほぼすべての人に提供できます。

source: By using Font Squirrel’s generator, you can roll back your web font’s character set to just the Basic Latin Unicode block10, for example.
ja: Font Squirrelのジェネレータを使用すれば、Webフォントの文字セットを、たとえばUnicodeの基本ラテン文字のブロック（脚注13）だけに限定することができます。

source: By virtue of relativity, we don’t just set an inclusive measure but ensure it within responsive layouts too.
ja: このような美しい相対化によって、インクルーシブなカラム幅を設定した上で、さらにレスポンシブなレイアウト内に確実に収めることもできます。

source: By wrapping the and in an <hgroup>, you could theoretically remove the from the outline, preventing it from creating a subheading:
ja: 以下のように、 とを <hgroup>でラップすることで、理論上はアウトラインからを取り除き、サブ見出しが作られることを防げます。

source: CSS is a blessing and a curse.
ja: CSSは祝福でもあり、呪いでもあります。

source: Certainly, unlabeled browser tabs are a frustrating shortcoming for most anyone, but there are additional implications for assistive technology users.
ja: 確かに、ブラウザのタブにラベルがないと、たいていのユーザーはフラストレーションを感じるでしょう。しかし、それだけではなく、支援技術のユーザーにも影響が生じます。

source: Content Breakpoints
ja: コンテンツのブレイクポイント
